tests/integration/test_multiphaseRadiation_bordbar/foam_template/0.org/ha
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.002";
    object      ha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
78608
(
-9041242.28
-9041242.25
-9041242.25
-9041242.25
-9041242.25
-9041242.25
-9041242.25
-9041242.25
...
)
;

boundaryField
{
    walls
    {
        type            fixedEnergy;
        value           uniform -9134870.43351401; 
    }
}


// ************************************************************************* //
