tests/integration/test_multiphaseRadiation_bordbar/foam_template/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//mechanismFile "gri30.yaml";
mechanismFile "gri30_nonreactive.yaml";
phaseName "gri30";
energyType ha; 
transportModel UnityLewis;

useSoret false;

inertSpecies     N2;

liquids
{
}

solids
{
   ash;
   C;
}


// ************************************************************************* //
