tests/integration/test_multiphaseRadiation_bordbar/foam_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   10;

vertices
(
    (1 2 0)
    (-1 2 0)
    (-1 0 0)
    (1 0 0)
    (1 2 4)
    (-1 2 4)
    (-1 0 4)
    (1 0 4)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (34 34 68) simpleGrading 
    (
	1
	1
	(
	    (0.01	0.04	 1)
	    (0.05625	0.12	 1)
	    ( 0.015	0.04	 1)
	    ( 0.025	 0.08	 1)
	    ( 0.01875	 0.04	 1)
	    ( 0.025	 0.04	 1)
	    ( 0.03125	 0.04	 1)
	    ( 0.075	 0.08	 1)
	    ( 0.04375	 0.04	 1)
	    ( 0.2	 0.16	 1)
	    ( 0.0625	 0.04	 1)
	    ( 0.15	 0.08	 1)

	    ( 0.06875	 0.04	 1)
	    ( 0.1875	 0.12	 1)
	    ( 0.03125	 0.04	 1)
	)
    )

);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
    	    (3 2 6 7)
	    (0 1 5 4)
            (0 4 7 3)
            (0 1 2 3)
            (1 5 6 2)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
