tests/integration/test_multiphaseRadiation_bordbar/foam_template/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellLimited Gauss linear 1;
    grad(p)         Gauss linear;
}

divSchemes
{
    default           none;

    div(phi,U)        Gauss linear;
    div(phid,p)       Gauss linear;
    div(phi,K)        Gauss linear;
    div(phi,k)        Gauss limitedLinear 1;
    div(phi,epsilon)  Gauss limitedLinear 1;
    div(phi,Z)        Gauss limitedLinear01 1;
    div(phi,PV)       Gauss limitedLinear 1;
    div(U)            Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,Yi)     Gauss limitedLinear 1;
    div(phi,h)     Gauss limitedLinear 1;
    div(phi,ha)     Gauss limitedLinear 1;
    //div(phi,ha)		Gauss upwind;
    
    div(Ji,Ii_h)		Gauss upwind;

}

laplacianSchemes
{
    default         Gauss linear limited 0.5;//Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.5;//orthogonal;
}
fluxRequired
{
    default no;

    "ILambda_.*";
}


// ************************************************************************* //
